# -------------------------------------------------------------------------------------------------------
# Задача 1:  Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и
# количество элементов нужно ввести с клавиатуры. Формула для получения n-го члена прогрессии:
# an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.
# -------------------------------------------------------------------------------------------------------

num_one = int(input("Введите первый элемент: "))
num_length = int(
    input("Введите количество элементов: "))
num_diff = int(input("Введите разность: "))
array = []
array.append(num_one)
array = [array[0] + (i - 1)*num_diff for i in range(num_one, num_length+1)]
print(array)

# -------------------------------------------------------------------------------------------------------
# Задача 2: Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону
# (т.е. не меньше заданного минимума и не больше заданного максимума)
# -------------------------------------------------------------------------------------------------------
from random import randint

def create_array(array_length) -> list():
    array = [randint(1, 10) for _ in range(array_length)]
    return array

def get_index_minmax(num_min, num_max, array) -> list():
    arr = [i for i in range(len(array)) if num_min <= array[i] <= num_max]
    return arr

array_length = int(input("Введите размер списка: "))
num_min = int(input("Введите минимум: "))
num_max = int(input("Введите максимум: "))
array = create_array(array_length)
print(array)
print(f"Индексы элементов в диапазоне значений {num_min}:{num_max} = {get_index_minmax(num_min, num_max, array)}")
